-- Запрос №1
SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД, Н_ВЕДОМОСТИ.ДАТА
FROM Н_ТИПЫ_ВЕДОМОСТЕЙ
INNER JOIN Н_ВЕДОМОСТИ ON Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = Н_ВЕДОМОСТИ.ВЕД_ИД
WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД < 2 AND Н_ВЕДОМОСТИ.ИД = 39921;

-- Запрос №2
SELECT Н_ЛЮДИ.ОТЧЕСТВО, Н_ВЕДОМОСТИ.ИД, Н_СЕССИЯ.ДАТА
FROM Н_ЛЮДИ
LEFT JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
LEFT JOIN Н_СЕССИЯ ON Н_ВЕДОМОСТИ.СЭС_ИД = Н_СЕССИЯ.ИД
WHERE Н_ЛЮДИ.ФАМИЛИЯ > 'Афанасьев' 
AND Н_ВЕДОМОСТИ.ДАТА < DATE '2010-06-18' 
AND Н_СЕССИЯ.ДАТА = DATE '2002-01-04';

-- Запрос №3
SELECT COUNT(*) as счётчик
FROM Н_ЛЮДИ
    JOIN Н_УЧЕНИКИ
        ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    JOIN Н_ПЛАНЫ
        ON Н_ПЛАНЫ.ИД = Н_УЧЕНИКИ.ПЛАН_ИД
    JOIN Н_ФОРМЫ_ОБУЧЕНИЯ
        ON Н_ФОРМЫ_ОБУЧЕНИЯ.ИД = Н_ПЛАНЫ.ФО_ИД
WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.ИМЯ_В_ИМИН_ПАДЕЖЕ = 'вечерняя'
AND EXTRACT(YEAR FROM DATE '2024-01-01') - EXTRACT(YEAR FROM Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ) > 25;

 -- Запрос №4
SELECT Н_ЛЮДИ.ФАМИЛИЯ, COUNT(*) AS "Число людей на очной форме обучения" FROM (SELECT Н_ЛЮДИ.ФАМИЛИЯ, Н_ФОРМЫ_ОБУЧЕНИЯ.ИМЯ_В_ИМИН_ПАДЕЖЕ
FROM Н_ЛЮДИ
    JOIN Н_УЧЕНИКИ
        ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    JOIN Н_ПЛАНЫ
        ON Н_ПЛАНЫ.ИД = Н_УЧЕНИКИ.ПЛАН_ИД
    JOIN Н_ФОРМЫ_ОБУЧЕНИЯ
        ON Н_ФОРМЫ_ОБУЧЕНИЯ.ИД = Н_ПЛАНЫ.ФО_ИД
WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.ИМЯ_В_ИМИН_ПАДЕЖЕ = 'очная') AS Н_ЛЮДИ
GROUP BY Н_ЛЮДИ.ФАМИЛИЯ
HAVING COUNT(*) < 50
ORDER BY Н_ЛЮДИ.ФАМИЛИЯ;

-- Запрос №5 
SELECT Н_ВЕДОМОСТИ.ЧЛВК_ИД, AVG(CASE WHEN (Н_ВЕДОМОСТИ.ОЦЕНКА <> 'зачет' AND Н_ВЕДОМОСТИ.ОЦЕНКА <> 'осв' AND Н_ВЕДОМОСТИ.ОЦЕНКА <> 'незач' AND Н_ВЕДОМОСТИ.ОЦЕНКА <> 'неявка') THEN
CAST (Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER) END) AS СР_ОЦЕНКА, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО
FROM Н_ВЕДОМОСТИ
    JOIN Н_УЧЕНИКИ
        ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
    JOIN Н_ЛЮДИ
        ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE Н_УЧЕНИКИ.ГРУППА = '4100'
GROUP BY Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО
HAVING AVG(CASE WHEN (Н_ВЕДОМОСТИ.ОЦЕНКА <> 'зачет' AND Н_ВЕДОМОСТИ.ОЦЕНКА <> 'осв' AND Н_ВЕДОМОСТИ.ОЦЕНКА <> 'незач' AND Н_ВЕДОМОСТИ.ОЦЕНКА <> 'неявка') THEN
CAST (Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER) END) >= (SELECT max(CASE WHEN (Н_ВЕДОМОСТИ.ОЦЕНКА <> 'зачет' AND Н_ВЕДОМОСТИ.ОЦЕНКА <> 'осв' AND Н_ВЕДОМОСТИ.ОЦЕНКА <> 'незач' AND Н_ВЕДОМОСТИ.ОЦЕНКА <> 'неявка') THEN
CAST (Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER) END) FROM Н_ВЕДОМОСТИ JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД WHERE Н_УЧЕНИКИ.ГРУППА = '1101');

-- Запрос №6
SELECT Н_УЧЕНИКИ.ГРУППА, Н_УЧЕНИКИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, Н_УЧЕНИКИ.П_ПРКОК_ИД
FROM Н_ЛЮДИ
CROSS JOIN Н_УЧЕНИКИ
CROSS JOIN Н_ПЛАНЫ
CROSS JOIN Н_ФОРМЫ_ОБУЧЕНИЯ
WHERE (Н_УЧЕНИКИ.ПРИЗНАК = 'отчислен' 
AND Н_УЧЕНИКИ.СОСТОЯНИЕ = 'утверждение'
AND DATE(Н_УЧЕНИКИ.НАЧАЛО) = '2012-09-01'
AND Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная');

-- Запрос №7
SELECT COUNT(DISTINCT "Н_ВЕДОМОСТИ"."ЧЛВК_ИД") AS "Количество хорошистов"
FROM "Н_ВЕДОМОСТИ"
JOIN "Н_ОЦЕНКИ" ON "Н_ВЕДОМОСТИ"."ОЦЕНКА" = "Н_ОЦЕНКИ"."КОД"
JOIN "Н_УЧЕНИКИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
JOIN "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
WHERE "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ' AND "Н_ОЦЕНКИ"."СОРТ" = 4;